app/views/fleets/_form.html.erb

SELECT "factions".* FROM "factions"
---

	<%= f.collection_select( :faction_id, Faction.all, :id, :name ) %>