app/views/groups/_form.html.erb

<!-- clean up DB call outside of view -->
	<%= f.collection_select( :ship_id, Ship.where(tonnage_id: params[:tonnage], faction: @fleet.faction), :id, :dropdown_display ) %>
---
SELECT "ships".* FROM "ships" WHERE "ships"."tonnage_id" = $1 AND "ships"."faction_id" = 1  [["tonnage_id", 1]]