app/views/battlegroups/_battlegroup.html.erb

		<ul>
	<% battlegroup.groups.each do |group| %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."battlegroup_id" = $1  [["battlegroup_id", 3]]