app/views/battlegroups/_form.html.erb

<%= form_for [@user, @fleet, @battlegroup] do |f| %>
	<%= f.collection_select(:battlegroup_type_id, BattlegroupType.all, :id, :name) %>
---
SELECT "battlegroup_types".* FROM "battlegroup_types"