app/views/battlegroups/show.html.erb

<ul class='group-list'>
	<%= render @battlegroup.groups %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."battlegroup_id" = $1  [["battlegroup_id", 3]]