app/controllers/battlegroups_controller.rb

SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "battlegroups".* FROM "battlegroups" WHERE "battlegroups"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."battlegroup_id" = $1  [["battlegroup_id", 3]]
---
	def show
		@user = current_user
		@fleet = Fleet.find_by(id: params[:fleet_id])
		@battlegroup = Battlegroup.find_by(id: params[:id])

SELECT  "fleets".* FROM "fleets" WHERE "fleets"."fleet_id" = $1 LIMIT $2  [["fleet_id", "4"], ["LIMIT", 1]]
---
	def new
		@user = current_user
		@fleet = Fleet.find_by(id: params[:fleet_id])

SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "battlegroups" ("battlegroup_type_id", "created_at", "updated_at", "fleet_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["battlegroup_type_id", 4], ["created_at", 2017-04-06 17:24:04 UTC], ["updated_at", 2017-04-06 17:24:04 UTC], ["fleet_id", 4]]
DELETE FROM "battlegroups" WHERE "battlegroups"."id" = $1  [["id", 35]]
---
	def create
		#need to verify not at limit for X type
		@user = current_user
		@fleet = Fleet.find_by(id: params[:fleet_id])
		@battlegroup = Battlegroup.new(battlegroup_params)
		@battlegroup.update_attribute(:fleet_id, @fleet.id)
		if @battlegroup.save
			flash[:success] = "Battlegroup added"
			redirect_to user_fleet_path(@user, @fleet)
		else
			# instance is persisted even though invalid/unsaveable - why? Because of .new??  Cleaner way to instantiate???
			@battlegroup.destroy

SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "battlegroups".* FROM "battlegroups" WHERE "battlegroups"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."battlegroup_id" = $1  [["battlegroup_id", 10]]
DELETE FROM "battlegroups" WHERE "battlegroups"."id" = $1  [["id", 10]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 9]]
---
	def destroy
		user = current_user
		fleet = Fleet.find_by(id: params[:fleet_id])
		battlegroup = Battlegroup.find_by(id: params[:id])
		battlegroup.destroy