app/controllers/fleets_controller.rb

	def index
		@user = current_user
		@fleets = Fleet.where(user_id: @user.id)
---
SELECT "fleets".* FROM "fleets" WHERE "fleets"."user_id" = $1  [["user_id", 3]]

	def show
		@user = current_user
		@fleet = Fleet.find_by(id: params[:id])
		@battlegroups = @fleet.battlegroups.joins(:battlegroup_type).merge(BattlegroupType.order(:name))
---
SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "battlegroups".* FROM "battlegroups" INNER JOIN "battlegroup_types" ON "battlegroup_types"."id" = "battlegroups"."battlegroup_type_id" WHERE "battlegroups"."fleet_id" = $1 ORDER BY "battlegroup_types"."name" ASC  [["fleet_id", 4]]

	def create
		#requires someone be logged in - add verification
		@user = current_user
		@fleet = Fleet.new( user_id: @user.id )
		@fleet.update_attributes(fleet_params)

		if @fleet.save
---
INSERT INTO "fleets" ("name", "faction_id", "points_level", "cost", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "test fleet"], ["faction_id", 1], ["points_level", 750], ["cost", 0], ["created_at", 2017-04-05 17:18:15 UTC], ["updated_at", 2017-04-05 17:18:15 UTC], ["user_id", 3]]

	def destroy
		Fleet.find_by(id: params[:id]).destroy
---
DELETE FROM "fleets" WHERE "fleets"."id" = $1  [["id", 3]]
SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]