app/controllers/groups_controller.rb

	def show
		@user = current_user
		@fleet = Fleet.find_by(id: params[:fleet_id])
		@battlegroup = Battlegroup.find_by(id: params[:battlegroup_id])
---
SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "battlegroups".* FROM "battlegroups" WHERE "battlegroups"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

	def new
		@user = current_user
		@fleet = Fleet.find_by(id: params[:fleet_id])
		@battlegroup = Battlegroup.find_by(id: params[:battlegroup_id])
---
SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "battlegroups".* FROM "battlegroups" WHERE "battlegroups"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

	def create
		@user = current_user
		@fleet = Fleet.find_by(id: params[:fleet_id])
		@battlegroup = Battlegroup.find_by(id: params[:battlegroup_id])
		@group = Group.new(group_params)
		@group.update_attributes(battlegroup_id: params[:battlegroup_id], group_size: starting_size(@group))
		if @group.save
---
SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "battlegroups".* FROM "battlegroups" WHERE "battlegroups"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."battlegroup_id" = $1  [["battlegroup_id", 12]]
INSERT INTO "groups" ("ship_id", "created_at", "updated_at", "group_size", "battlegroup_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ship_id", 16], ["created_at", 2017-04-10 18:03:50 UTC], ["updated_at", 2017-04-10 18:03:50 UTC], ["group_size", 6], ["battlegroup_id", 23]]

	def edit
		@user = current_user
		@fleet = Fleet.find_by(id: params[:fleet_id])
		@battlegroup = Battlegroup.find_by(id: params[:battlegroup_id])
---
SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "battlegroups".* FROM "battlegroups" WHERE "battlegroups"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

	def update
		@user = current_user
		@fleet = Fleet.find_by(id: params[:fleet_id])
		@battlegroup = Battlegroup.find_by(id: params[:battlegroup_id])
		@group = Group.find_by(id: params[:id])
		@group.group_size = params[:group][:group_size])
		if @group.save
---
SELECT "battlegroups".* FROM "battlegroups" WHERE "battlegroups"."fleet_id" = $1  [["fleet_id", 5]]
SELECT "groups".* FROM "groups" INNER JOIN "battlegroups" ON "groups"."battlegroup_id" = "battlegroups"."id" WHERE "battlegroups"."fleet_id" = $1  [["fleet_id", 5]]
SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "battlegroups".* FROM "battlegroups" WHERE "battlegroups"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."battlegroup_id" = $1  [["battlegroup_id", 9]]
UPDATE "groups" SET "group_size" = $1, "updated_at" = $2 WHERE "groups"."id" = $3  [["group_size", 2], ["updated_at", 2017-04-09 21:12:33 UTC], ["id", 8]]

	def destroy
		Group.find_by(id: params[:id]).destroy
		flash[:success] = "Group decomissioned"
		user = current_user
		fleet = Fleet.find_by(id: params[:fleet_id])
		battlegroup = Battlegroup.find_by(id: params[:battlegroup_id])
---
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 12]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "battlegroups".* FROM "battlegroups" WHERE "battlegroups"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."battlegroup_id" = $1  [["battlegroup_id", 13]]