app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Ahrkimedes"], ["password_digest", "$2a$10$PYRsMCcfwfEo/b4fBJWp1O3sVrvhpSKpiJetOjmVHT5hQnOte.tK2"], ["created_at", 2017-04-03 00:16:15 UTC], ["updated_at", 2017-04-03 00:16:15 UTC]]
---
	def create
		@user = User.create(user_params)